app/views/reservas/_form.html.erb

SELECT `pacientes`.* FROM `pacientes`
---
 <div class="col-xs-6">
     <%= form.collection_select :paciente_id, Paciente.all, :id, :completo,
                  {selected: @reserva.paciente_id, include_blank: 'Seleccione Paciente'},
                  {class: "form-control"} %>

SELECT `medicos`.* FROM `medicos`
---
 <div class="col-xs-6">
     <%= form.collection_select :medico_id, Medico.all, :id, :completo,
                  {selected: @reserva.medico_id, include_blank: 'Seleccione medico'},
                  {class: "form-control"} %>