app/views/departamentos/_form.html.erb

SELECT `regiones`.* FROM `regiones`
---
 <div class="col-xs-5">
     <%= form.collection_select :regione_id, Regione.all, :id, :nombre,
                  {selected: @departamento.regione_id, include_blank: 'Seleccione region'},
                  {class: "form-control"} %>