app/views/horarios/_form.html.erb

 <div class="col-xs-6">
     <%= form.collection_select :medico_id, Medico.all, :id, :completo,
                  {selected: @horario.medico_id, include_blank: 'Seleccione medico'},
                  {class: "form-control"} %>
---
SELECT `medicos`.* FROM `medicos`

 <div class="col-xs-6">
     <%= form.collection_select :dia_id, Dia.all, :id, :nombre,
                  {selected: @horario.dia_id, include_blank: 'Seleccione dia'},
                  {class: "form-control"} %>
---
SELECT `dias`.* FROM `dias`