app/views/ciudades/_form.html.erb

 <div class="col-xs-5">
     <%= form.collection_select :departamento_id, Departamento.all, :id, :nombre,
                  {selected: @ciudade.departamento_id, include_blank: 'Seleccione departamento'},
                  {class: "form-control"} %>
---
SELECT `departamentos`.* FROM `departamentos`