app/controllers/audits_controller.rb

SELECT `audits`.* FROM `audits`
---
def index
   @audits= Audit.all