app/controllers/ciudades_controller.rb

  def index


      @page = (params[:page] || 0).to_i

   if params[:keywords].present?
     @keywords = params[:keywords]
     @ciudades = Ciudade.where("lower(nombre) LIKE '%#{@keywords.downcase}%'").order("nombre ASC" )
                    .offset(PAGE_SIZE * @page).limit(PAGE_SIZE)
     number_of_records = Ciudade.where("lower(nombre) LIKE '%#{@keywords.downcase}%'").count

       else
     @ciudades = Ciudade.order('nombre ASC').offset(PAGE_SIZE * @page).limit(PAGE_SIZE)
---
SELECT  `ciudades`.* FROM `ciudades` ORDER BY nombre ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `ciudades`