app/controllers/dashboards_controller.rb

 def index
     @especialidades= Especialidade.all
---
SELECT `especialidades`.* FROM `especialidades`