app/controllers/departamentos_controller.rb

  def index


      @page = (params[:page] || 0).to_i

   if params[:keywords].present?
     @keywords = params[:keywords]
     @departamentos = Departamento.where("lower(nombre) LIKE '%#{@keywords.downcase}%'").order("codigo ASC" )
                    .offset(PAGE_SIZE * @page).limit(PAGE_SIZE)
     number_of_records = Departamento.where("lower(nombre) LIKE '%#{@keywords.downcase}%'").count

       else
     @departamentos = Departamento.order('codigo ASC').offset(PAGE_SIZE * @page).limit(PAGE_SIZE)
---
SELECT  `departamentos`.* FROM `departamentos` ORDER BY codigo ASC LIMIT 19 OFFSET 0
SELECT COUNT(*) FROM `departamentos`

  def create

    @departamento = Departamento.create(departamento_params)
---
INSERT INTO `departamentos` (`nombre`, `regione_id`, `created_at`, `updated_at`, `codigo`) VALUES ('Concepcion', 1, '2017-11-16 16:44:59', '2017-11-16 16:44:59', '01')