app/controllers/especialidades_controller.rb

  def index


      @page = (params[:page] || 0).to_i

   if params[:keywords].present?
     @keywords = params[:keywords]
     @especialidades = Especialidade.where("lower(descripcion) LIKE '%#{@keywords.downcase}%'").order("descripcion ASC" )
                    .offset(PAGE_SIZE * @page).limit(PAGE_SIZE)
     number_of_records = Especialidade.where("lower(descripcion) LIKE '%#{@keywords.downcase}%'").count

       else
     @especialidades = Especialidade.order('descripcion ASC').offset(PAGE_SIZE * @page).limit(PAGE_SIZE)
---
SELECT  `especialidades`.* FROM `especialidades` ORDER BY descripcion ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `especialidades`

  def create
    @especialidade = Especialidade.new(especialidade_params)

    respond_to do |format|
      if @especialidade.save
---
INSERT INTO `especialidades` (`descripcion`, `created_at`, `updated_at`) VALUES ('Clinica Medica', '2017-11-12 03:25:03', '2017-11-12 03:25:03')

  def update
    respond_to do |format|
      if @especialidade.update(especialidade_params)
---
UPDATE `especialidades` SET `descripcion` = 'Oftalmologo', `updated_at` = '2017-11-21 02:40:07' WHERE `especialidades`.`id` = 1

  def destroy
    @especialidade.destroy
---
DELETE FROM `especialidades` WHERE `especialidades`.`id` = 1

    def set_especialidade
      @especialidade = Especialidade.find(params[:id])
---
SELECT  `especialidades`.* FROM `especialidades` WHERE `especialidades`.`id` = 1 LIMIT 1