app/controllers/horarios_controller.rb

SELECT `horarios`.* FROM `horarios`
---
  def index
    @horarios = Horario.all