app/controllers/medicos_controller.rb

  def index


      @page = (params[:page] || 0).to_i

   if params[:keywords].present?
     @keywords = params[:keywords]
     @medicos = Medico.where("lower(ci) LIKE '%#{@keywords.downcase}%'").order("ci ASC" )
                    .offset(PAGE_SIZE * @page).limit(PAGE_SIZE)
     number_of_records = Medico.where("lower(ci) LIKE '%#{@keywords.downcase}%'").count

       else
     @medicos = Medico.order('ci ASC').offset(PAGE_SIZE * @page).limit(PAGE_SIZE)
---
SELECT  `medicos`.* FROM `medicos` ORDER BY ci ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `medicos`