app/controllers/pacientes_controller.rb

SELECT  `pacientes`.* FROM `pacientes` ORDER BY ci ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `pacientes`
---
  def index


      @page = (params[:page] || 0).to_i

   if params[:keywords].present?
     @keywords = params[:keywords]
     @pacientes = Paciente.where("lower(ci) LIKE '%#{@keywords.downcase}%'").order("ci ASC" )
                    .offset(PAGE_SIZE * @page).limit(PAGE_SIZE)
     number_of_records = Paciente.where("lower(ci) LIKE '%#{@keywords.downcase}%'").count

       else
     @pacientes = Paciente.order('ci ASC').offset(PAGE_SIZE * @page).limit(PAGE_SIZE)