app/controllers/regiones_controller.rb

  def index
    @regiones = Regione.all
---
SELECT `regiones`.* FROM `regiones`

  def create
    @regione = Regione.new(regione_params)

    respond_to do |format|
      if @regione.save
---
INSERT INTO `regiones` (`codigo`, `nombre`, `created_at`, `updated_at`) VALUES ('1', 'Occidental', '2017-11-16 15:21:28', '2017-11-16 15:21:28')

    def set_regione
      @regione = Regione.find(params[:id])
---
SELECT  `regiones`.* FROM `regiones` WHERE `regiones`.`id` = 2 LIMIT 1