app/controllers/reservas_controller.rb

  def index
    @reservas = Reserva.all
---
SELECT `reservas`.* FROM `reservas`