app/controllers/sexos_controller.rb

  def index
    @sexos = Sexo.all
---
SELECT `sexos`.* FROM `sexos`

  def create
    @sexo = Sexo.new(sexo_params)

    respond_to do |format|
      if @sexo.save
---
INSERT INTO `sexos` (`nombre`, `created_at`, `updated_at`) VALUES ('Masculino', '2017-11-21 02:46:21', '2017-11-21 02:46:21')

    def set_sexo
      @sexo = Sexo.find(params[:id])
---
SELECT  `sexos`.* FROM `sexos` WHERE `sexos`.`id` = 1 LIMIT 1