app/views/medicos/_form.html.erb

SELECT `sexos`.* FROM `sexos`
---
 <div class="col-xs-3">
     <%= form.collection_select :sexo_id, Sexo.all, :id, :nombre,
                  {selected: @medico.sexo_id, include_blank: ''},
                  {class: "form-control"} %>

SELECT `especialidades`.* FROM `especialidades`
---
 <div class="col-xs-6">
     <%= form.collection_select :especialidade_id, Especialidade.all, :id, :descripcion,
                  {selected: @medico.especialidade_id, include_blank: 'Seleccione especialidad'},
                  {class: "form-control"} %>

SELECT `ciudades`.* FROM `ciudades`
---
 <div class="col-xs-6">
     <%= form.collection_select :ciudade_id, Ciudade.all, :id, :nombre,
                  {selected: @medico.ciudade_id, include_blank: 'Seleccione ciudad'},
                  {class: "form-control"} %>